www/templates/Create AutomationByDate.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:localhost-paint" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:handleRequest>
			<contextId xsi:type="xsd:string">01234567890</contextId>
			<className xsi:type="xsd:string">bus_facade_campaign_automationByDate</className>
			<processName xsi:type="xsd:string">create</processName>
			<entityData xsi:type="ns2:Map">
				<item>
					<key xsi:type="xsd:string">automationType</key>
					<value xsi:type="xsd:string">DATE</value>
				</item>
				<item>
					<key xsi:type="xsd:string">listId</key>
					<value xsi:nil="true"/>
				</item>
				<item>
					<key xsi:type="xsd:string">automationName</key>
					<value xsi:nil="true"/>
				</item>
				<item>
					<key xsi:type="xsd:string">automationStatus</key>
					<value xsi:type="xsd:string">ACTIVE</value>
				</item>
			</entityData>
			<processData xsi:nil="true"/>
		</ns1:handleRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>